; domain
;; ==========================================================================
;; Domain: Interplanetary Museum Vault (IMV) - Problem 2 with pod capacity patch
;;
;; Same as Problem 2's domain, with one added constraint: a pod can hold at
;; most one artifact at a time since secure-in-pod never checked if the pod already
;; held something.
;; ==========================================================================

(define (domain imv-transport-multi-pod-capacity)

  (:requirements :strips :typing :negative-preconditions)

  (:types
    item
    artifact pod - item
    robot location slot
  )

  (:predicates
    (at ?x - item ?l - location)
    (robot-at ?r - robot ?l - location)

    (slot-of ?s - slot ?r - robot)
    (slot-free ?s - slot)
    (holding ?s - slot ?x - item)

    (in-pod ?a - artifact ?p - pod)
    (pod-empty ?p - pod)                         ; NEW: pod p currently holds no artifact

    (tunnel-connected ?l1 - location ?l2 - location)
    (tunnel-beta-connected ?l1 - location ?l2 - location)
    (is-hall-beta ?l - location)

    (sealed ?r - robot)
    (seismic-active)

    (can-fly ?r - robot)
    (can-carry-pod ?r - robot)

    (is-fragile ?a - artifact)
    (is-alpha ?a - artifact)
    (is-core-sample ?a - artifact)

    (stabilized ?a - artifact)
    (cooled ?a - artifact)
  )

  (:action move-via-tunnel
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (tunnel-connected ?from ?to) (sealed ?r))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action move-via-tunnel-to-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (tunnel-beta-connected ?from ?to)
                        (sealed ?r) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action activate-sealing
    :parameters (?r - robot)
    :precondition (not (sealed ?r))
    :effect (sealed ?r)
  )

  (:action deactivate-sealing
    :parameters (?r - robot)
    :precondition (sealed ?r)
    :effect (not (sealed ?r))
  )

  (:action fly
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (not (is-hall-beta ?from)) (not (is-hall-beta ?to)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action fly-to-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (is-hall-beta ?to) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action fly-from-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (is-hall-beta ?from) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action pickup-pod
    :parameters (?r - robot ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (at ?p ?l) (can-carry-pod ?r)
                        (slot-of ?s ?r) (slot-free ?s))
    :effect (and (holding ?s ?p) (not (at ?p ?l)) (not (slot-free ?s)))
  )

  (:action putdown-pod
    :parameters (?r - robot ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p))
    :effect (and (at ?p ?l) (slot-free ?s) (not (holding ?s ?p)))
  )

  (:action pickup-artifact
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (at ?a ?l) (not (is-fragile ?a))
                        (slot-of ?s ?r) (slot-free ?s))
    :effect (and (holding ?s ?a) (not (at ?a ?l)) (not (slot-free ?s)))
  )

  (:action putdown-artifact
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?a))
    :effect (and (at ?a ?l) (slot-free ?s) (not (holding ?s ?a)))
  )

  ;; ---- handling fragile artifacts ------
  ;; NEW: the pod must be empty before an artifact can be secured in it.
  
  (:action secure-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p)
                        (at ?a ?l) (is-fragile ?a) (pod-empty ?p))
    :effect (and (in-pod ?a ?p) (stabilized ?a) (not (at ?a ?l)) (not (pod-empty ?p)))
  )

  (:action unload-from-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p) (in-pod ?a ?p))
    :effect (and (at ?a ?l) (not (in-pod ?a ?p)) (pod-empty ?p))
  )

  (:action cool
    :parameters (?r - robot ?a - artifact ?s - slot)
    :precondition (and (slot-of ?s ?r) (holding ?s ?a) (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )

  (:action cool-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?s - slot)
    :precondition (and (slot-of ?s ?r) (holding ?s ?p) (in-pod ?a ?p)
                        (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )
)

; problem
;; Same problem as scaleup experiment but with constrained pod capacity

(define (problem imv-transport-p2-scaleup-podcap)
  (:domain imv-transport-multi-pod-capacity)

  (:objects
    curator1 - robot
    drone1 - robot
    slot-c1a slot-c1b - slot
    slot-d1a - slot
    pod1 pod2 - pod
    art-beta-1 art-beta-2 art-beta-3 art-beta-4 - artifact
    art-alpha-1 art-alpha-2 art-alpha-3 art-alpha-4 - artifact
    core-sample-1 core-sample-2 - artifact
    entrance tunnel anti-vibration-pods hall-alpha hall-beta cryo-chamber stasis-lab - location
  )

  (:init
    (robot-at curator1 entrance)
    (robot-at drone1 entrance)

    (slot-of slot-c1a curator1)
    (slot-of slot-c1b curator1)
    (slot-free slot-c1a)
    (slot-free slot-c1b)

    (slot-of slot-d1a drone1)
    (slot-free slot-d1a)

    (can-carry-pod curator1)
    (can-fly drone1)

    (at pod1 anti-vibration-pods)
    (at pod2 anti-vibration-pods)
    (pod-empty pod1)                              ; NEW
    (pod-empty pod2)                              ; NEW

    (at art-beta-1 hall-beta)
    (at art-beta-2 hall-beta)
    (at art-beta-3 hall-beta)
    (at art-beta-4 hall-beta)
    (at art-alpha-1 hall-alpha)
    (at art-alpha-2 hall-alpha)
    (at art-alpha-3 hall-alpha)
    (at art-alpha-4 hall-alpha)
    (at core-sample-1 cryo-chamber)
    (at core-sample-2 cryo-chamber)

    (is-fragile art-beta-2)
    (is-fragile art-beta-3)
    (is-alpha art-alpha-1)
    (is-alpha art-alpha-2)
    (is-fragile art-alpha-2)
    (is-alpha art-alpha-3)
    (is-fragile art-alpha-3)
    (is-alpha art-alpha-4)
    (is-core-sample core-sample-1)
    (is-core-sample core-sample-2)

    (tunnel-connected entrance tunnel)
    (tunnel-connected tunnel entrance)
    (tunnel-connected anti-vibration-pods tunnel)
    (tunnel-connected tunnel anti-vibration-pods)
    (tunnel-connected hall-alpha tunnel)
    (tunnel-connected tunnel hall-alpha)
    (tunnel-connected cryo-chamber tunnel)
    (tunnel-connected tunnel cryo-chamber)
    (tunnel-connected stasis-lab tunnel)
    (tunnel-connected tunnel stasis-lab)

    (tunnel-beta-connected hall-beta tunnel)
    (tunnel-beta-connected tunnel hall-beta)

    (is-hall-beta hall-beta)
  )

  (:goal
    (and
      (at art-beta-1 stasis-lab)
      (stabilized art-beta-2) (at art-beta-2 stasis-lab)
      (stabilized art-beta-3) (at art-beta-3 stasis-lab)
      (at art-beta-4 stasis-lab)
      (cooled art-alpha-1) (at art-alpha-1 cryo-chamber)
      (stabilized art-alpha-2) (cooled art-alpha-2) (at art-alpha-2 cryo-chamber)
      (stabilized art-alpha-3) (cooled art-alpha-3) (at art-alpha-3 cryo-chamber)
      (cooled art-alpha-4) (at art-alpha-4 cryo-chamber)
      (at core-sample-1 stasis-lab)
      (at core-sample-2 stasis-lab)
    )
  )
)

; plan
1. (activate-sealing curator1)
   added: (sealed curator1)
   goals met: 0 of 18
2. (move-via-tunnel curator1 entrance tunnel)
   deleted: (robot-at curator1 entrance)
   added: (robot-at curator1 tunnel)
   goals met: 0 of 18
3. (move-via-tunnel curator1 tunnel anti-vibration-pods)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 anti-vibration-pods)
   goals met: 0 of 18
4. (fly drone1 entrance cryo-chamber)
   deleted: (robot-at drone1 entrance)
   added: (robot-at drone1 cryo-chamber)
   goals met: 0 of 18
5. (pickup-artifact drone1 core-sample-1 cryo-chamber slot-d1a)
   deleted: (at core-sample-1 cryo-chamber) (slot-free slot-d1a)
   added: (holding slot-d1a core-sample-1)
   goals met: 0 of 18
6. (pickup-pod curator1 pod1 anti-vibration-pods slot-c1a)
   deleted: (at pod1 anti-vibration-pods) (slot-free slot-c1a)
   added: (holding slot-c1a pod1)
   goals met: 0 of 18
7. (move-via-tunnel curator1 anti-vibration-pods tunnel)
   deleted: (robot-at curator1 anti-vibration-pods)
   added: (robot-at curator1 tunnel)
   goals met: 0 of 18
8. (fly drone1 cryo-chamber stasis-lab)
   deleted: (robot-at drone1 cryo-chamber)
   added: (robot-at drone1 stasis-lab)
   goals met: 0 of 18
9. (move-via-tunnel curator1 tunnel hall-alpha)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-alpha)
   goals met: 0 of 18
10. (secure-in-pod curator1 art-alpha-2 pod1 hall-alpha slot-c1a)
   deleted: (at art-alpha-2 hall-alpha) (pod-empty pod1)
   added: (in-pod art-alpha-2 pod1) (stabilized art-alpha-2)
   goals met: 1 of 18
11. (putdown-artifact drone1 core-sample-1 stasis-lab slot-d1a)
   deleted: (holding slot-d1a core-sample-1)
   added: (at core-sample-1 stasis-lab) (slot-free slot-d1a)
   goals met: 2 of 18
12. (pickup-artifact curator1 art-alpha-1 hall-alpha slot-c1b)
   deleted: (at art-alpha-1 hall-alpha) (slot-free slot-c1b)
   added: (holding slot-c1b art-alpha-1)
   goals met: 2 of 18
13. (cool-in-pod curator1 art-alpha-2 pod1 slot-c1a)
   added: (cooled art-alpha-2)
   goals met: 3 of 18
14. (cool curator1 art-alpha-1 slot-c1b)
   added: (cooled art-alpha-1)
   goals met: 4 of 18
15. (move-via-tunnel curator1 hall-alpha tunnel)
   deleted: (robot-at curator1 hall-alpha)
   added: (robot-at curator1 tunnel)
   goals met: 4 of 18
16. (move-via-tunnel curator1 tunnel cryo-chamber)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 cryo-chamber)
   goals met: 4 of 18
17. (unload-from-pod curator1 art-alpha-2 pod1 cryo-chamber slot-c1a)
   deleted: (in-pod art-alpha-2 pod1)
   added: (at art-alpha-2 cryo-chamber) (pod-empty pod1)
   goals met: 5 of 18
18. (putdown-artifact curator1 art-alpha-1 cryo-chamber slot-c1b)
   deleted: (holding slot-c1b art-alpha-1)
   added: (at art-alpha-1 cryo-chamber) (slot-free slot-c1b)
   goals met: 6 of 18
19. (fly drone1 stasis-lab cryo-chamber)
   deleted: (robot-at drone1 stasis-lab)
   added: (robot-at drone1 cryo-chamber)
   goals met: 6 of 18
20. (pickup-artifact drone1 core-sample-2 cryo-chamber slot-d1a)
   deleted: (at core-sample-2 cryo-chamber) (slot-free slot-d1a)
   added: (holding slot-d1a core-sample-2)
   goals met: 6 of 18
21. (move-via-tunnel curator1 cryo-chamber tunnel)
   deleted: (robot-at curator1 cryo-chamber)
   added: (robot-at curator1 tunnel)
   goals met: 6 of 18
22. (fly drone1 cryo-chamber stasis-lab)
   deleted: (robot-at drone1 cryo-chamber)
   added: (robot-at drone1 stasis-lab)
   goals met: 6 of 18
23. (move-via-tunnel curator1 tunnel hall-alpha)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-alpha)
   goals met: 6 of 18
24. (secure-in-pod curator1 art-alpha-3 pod1 hall-alpha slot-c1a)
   deleted: (at art-alpha-3 hall-alpha) (pod-empty pod1)
   added: (in-pod art-alpha-3 pod1) (stabilized art-alpha-3)
   goals met: 7 of 18
25. (move-via-tunnel curator1 hall-alpha tunnel)
   deleted: (robot-at curator1 hall-alpha)
   added: (robot-at curator1 tunnel)
   goals met: 7 of 18
26. (cool-in-pod curator1 art-alpha-3 pod1 slot-c1a)
   added: (cooled art-alpha-3)
   goals met: 8 of 18
27. (move-via-tunnel curator1 tunnel cryo-chamber)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 cryo-chamber)
   goals met: 8 of 18
28. (unload-from-pod curator1 art-alpha-3 pod1 cryo-chamber slot-c1a)
   deleted: (in-pod art-alpha-3 pod1)
   added: (at art-alpha-3 cryo-chamber) (pod-empty pod1)
   goals met: 9 of 18
29. (move-via-tunnel curator1 cryo-chamber tunnel)
   deleted: (robot-at curator1 cryo-chamber)
   added: (robot-at curator1 tunnel)
   goals met: 9 of 18
30. (putdown-artifact drone1 core-sample-2 stasis-lab slot-d1a)
   deleted: (holding slot-d1a core-sample-2)
   added: (at core-sample-2 stasis-lab) (slot-free slot-d1a)
   goals met: 10 of 18
31. (move-via-tunnel-to-beta curator1 tunnel hall-beta)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-beta)
   goals met: 10 of 18
32. (secure-in-pod curator1 art-beta-2 pod1 hall-beta slot-c1a)
   deleted: (at art-beta-2 hall-beta) (pod-empty pod1)
   added: (in-pod art-beta-2 pod1) (stabilized art-beta-2)
   goals met: 11 of 18
33. (move-via-tunnel-to-beta curator1 hall-beta tunnel)
   deleted: (robot-at curator1 hall-beta)
   added: (robot-at curator1 tunnel)
   goals met: 11 of 18
34. (move-via-tunnel curator1 tunnel stasis-lab)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 stasis-lab)
   goals met: 11 of 18
35. (unload-from-pod curator1 art-beta-2 pod1 stasis-lab slot-c1a)
   deleted: (in-pod art-beta-2 pod1)
   added: (at art-beta-2 stasis-lab) (pod-empty pod1)
   goals met: 12 of 18
36. (fly drone1 stasis-lab hall-alpha)
   deleted: (robot-at drone1 stasis-lab)
   added: (robot-at drone1 hall-alpha)
   goals met: 12 of 18
37. (pickup-artifact drone1 art-alpha-4 hall-alpha slot-d1a)
   deleted: (at art-alpha-4 hall-alpha) (slot-free slot-d1a)
   added: (holding slot-d1a art-alpha-4)
   goals met: 12 of 18
38. (fly drone1 hall-alpha cryo-chamber)
   deleted: (robot-at drone1 hall-alpha)
   added: (robot-at drone1 cryo-chamber)
   goals met: 12 of 18
39. (cool drone1 art-alpha-4 slot-d1a)
   added: (cooled art-alpha-4)
   goals met: 13 of 18
40. (putdown-artifact drone1 art-alpha-4 cryo-chamber slot-d1a)
   deleted: (holding slot-d1a art-alpha-4)
   added: (at art-alpha-4 cryo-chamber) (slot-free slot-d1a)
   goals met: 14 of 18
41. (fly-to-beta drone1 cryo-chamber hall-beta)
   deleted: (robot-at drone1 cryo-chamber)
   added: (robot-at drone1 hall-beta)
   goals met: 14 of 18
42. (pickup-artifact drone1 art-beta-1 hall-beta slot-d1a)
   deleted: (at art-beta-1 hall-beta) (slot-free slot-d1a)
   added: (holding slot-d1a art-beta-1)
   goals met: 14 of 18
43. (fly-from-beta drone1 hall-beta stasis-lab)
   deleted: (robot-at drone1 hall-beta)
   added: (robot-at drone1 stasis-lab)
   goals met: 14 of 18
44. (putdown-artifact drone1 art-beta-1 stasis-lab slot-d1a)
   deleted: (holding slot-d1a art-beta-1)
   added: (at art-beta-1 stasis-lab) (slot-free slot-d1a)
   goals met: 15 of 18
45. (fly-to-beta drone1 stasis-lab hall-beta)
   deleted: (robot-at drone1 stasis-lab)
   added: (robot-at drone1 hall-beta)
   goals met: 15 of 18
46. (pickup-artifact drone1 art-beta-4 hall-beta slot-d1a)
   deleted: (at art-beta-4 hall-beta) (slot-free slot-d1a)
   added: (holding slot-d1a art-beta-4)
   goals met: 15 of 18
47. (fly-from-beta drone1 hall-beta stasis-lab)
   deleted: (robot-at drone1 hall-beta)
   added: (robot-at drone1 stasis-lab)
   goals met: 15 of 18
48. (putdown-artifact drone1 art-beta-4 stasis-lab slot-d1a)
   deleted: (holding slot-d1a art-beta-4)
   added: (at art-beta-4 stasis-lab) (slot-free slot-d1a)
   goals met: 16 of 18
49. (move-via-tunnel curator1 stasis-lab tunnel)
   deleted: (robot-at curator1 stasis-lab)
   added: (robot-at curator1 tunnel)
   goals met: 16 of 18
50. (move-via-tunnel-to-beta curator1 tunnel hall-beta)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-beta)
   goals met: 16 of 18
51. (secure-in-pod curator1 art-beta-3 pod1 hall-beta slot-c1a)
   deleted: (at art-beta-3 hall-beta) (pod-empty pod1)
   added: (in-pod art-beta-3 pod1) (stabilized art-beta-3)
   goals met: 17 of 18
52. (move-via-tunnel-to-beta curator1 hall-beta tunnel)
   deleted: (robot-at curator1 hall-beta)
   added: (robot-at curator1 tunnel)
   goals met: 17 of 18
53. (move-via-tunnel curator1 tunnel stasis-lab)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 stasis-lab)
   goals met: 17 of 18
54. (unload-from-pod curator1 art-beta-3 pod1 stasis-lab slot-c1a)
   deleted: (in-pod art-beta-3 pod1)
   added: (at art-beta-3 stasis-lab) (pod-empty pod1)
   goals met: 18 of 18
